Revit 2026 API

# PlanarFaceYVector Property

---

The Y-vector of the planar face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ YVector { get; }
```
```vb
Public ReadOnly Property YVector As XYZ
	Get
```
```cpp
public:
property XYZ^ YVector {
	XYZ^ get ();
}
```
```fsharp
member YVector : XYZ with get
```

#### Property Value

XYZ

Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector depending upon how Revit has structured this particular face.

#### Reference

PlanarFace Class

Autodesk.Revit.DB Namespace